performance/tests/idealStockAmounts.yml
execution:
  - concurreny: 1
    hold-for: 1m
    scenario: download-ideal-stock-amounts-csv

scenarios:
  download-ideal-stock-amounts-csv:
    requests:
      - url: ${__P(base-uri)}/api/oauth/token
        method: POST
        label: GetUserToken
        headers:
          Authorization: Basic ${__base64Encode(${__P(basic-auth)})}
        body:
          grant_type: password
          username: ${__P(username)}
          password: ${__P(password)}
        extract-jsonpath:
          access_token:
            jsonpath: $.access_token
      - url: ${__P(base-uri)}/api/idealStockAmounts?format=csv
        method: GET
        label: GetAnIdealStockAmountCSV
        headers:
          Authorization: Bearer ${access_token}

reporting:
    - module: passfail
      criteria:
      - p90 of GetAnIdealStockAmountCSV>500ms